#20200909
3+3

1:40
options(width=60)
#註解
#width is used to control the length
1:40
options(width=100)

10/3

3^3

33%%2

31%%7

31%/%7

3*3+3*2

ls()
interest.30=1.0025^30
ls()

interest_30=1.0025^30
ls()

initial.balance=3000
final.balance=initial.balance*interest_30
final.balance

intRate=0.01
n=10
principal=1500
payment=principal*intRate/(1-(1+intRate)^(-n))
payment

n=1:10
n
1.25(n*0.8)-n

#20200911
x <- 1:11
mean(x)
#[1]6
var(x)
#[1]11
sum(x-mean(x)^2)/10

A <- 1.e10
A=10^10
x <- 1:11+A
var(x)
#[1]11
sum(x-mean(x)^2)/10
#11
(sum(x^2)-11*mean(x)^2)/10
#0 !!!!!!!!!!!

x <- 1:100
sum(x)
#5050
SUM(x)
#error in SUM(x):沒有這個函數

objects()

c(1,3,5,7)
x=c(1,3,5,7)
x

y=c(1,1,1,1,1,1,1,1,1,1,1,1,
    1,1,1,1,1,1,1,1,1,1,1,1,
    1,1,1,1,1,1,1,1,1,1,1,1)
y 

numbers5to20 <- 5:20
new.v=c(numbers5to20,x,y,4:1)
new.v

new.v[10]
#[1]14
new.v[c(3,6,7)]
new.v[10:20]

x
#[1] 1 3 5 7
x[-4]
#[1] 1 3 5
new.v[-c(3:11)]
new.v[c(-2,3)]
#Error in new.v[c(-2, 3)] : 只有負數下標中才能有 0

x*10
#[1] 10 30 50 70

x-5
x^3

y1=1:4
x
#[1] 1 3 5 7
x^y1
#[1]    1    9  125 2401

x^y1[-4]
#Warning message:
# In x^y1[-4] : 較長的物件長度並非較短物件長度的倍數

z=x^y1[-4]

c(1,1,2,2,3,3,4,4,5,5,6,6,7,7,8,8,9,9,10,10)%%2:3
# [1] 1 1 0 2 1 0 0 1 1 2 0 0 1 1 0 2 1 0 0 1

seq(10,20,by=2)
#[1] 10 12 14 16 18 20
seq(10,21,by=2)
#[1] 10 12 14 16 18 20
rep(10,3)

rep(c(1,3),3)
#[1] 1 3 1 3 1 3
rep(seq(10,20,by=2),3)
#[1] 10 12 14 16 18 20 10 12 14 16 18 20 10 12 14 16 18 20
rep(c(1,3),c(3,4))
#[1] 1 1 1 3 3 3 3

#!!!!
rep(c(1,3),each=3)
#[1] 1 1 1 3 3 3

#!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
rep(seq(2,20,2),rep(2,10))
#[1]  2  2  4  4  6  6  8  8 10 10 12 12 14 14 16 16 18 18 20 20

##############################################################



